In [55]:
import pandas as pd
import numpy as np
df = pd.read_csv('lab2.csv',encoding='cp1251')
print(df)

     номер     пол  возраст  доход  рейтинг трат
0      1.0    Male     19.0   15.0          39.0
1      2.0    Male     21.0   15.0          81.0
2      3.0  Female     20.0   16.0           6.0
3      4.0  Female     23.0   16.0          77.0
4      5.0  Female     31.0   17.0          40.0
..     ...     ...      ...    ...           ...
195  195.0  Female     47.0  120.0          16.0
196  197.0  Female     45.0  126.0          28.0
197  198.0    Male     32.0  126.0          74.0
198  199.0    Male     32.0  137.0          18.0
199  200.0    Male     30.0  137.0          83.0

[200 rows x 5 columns]

In [56]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   номер         199 non-null    float64
 1   пол           199 non-null    object
 2   возраст       197 non-null    float64
 3   доход         197 non-null    float64
 4   рейтинг трат  199 non-null    float64
dtypes: float64(4), object(1)
memory usage: 7.9+ KB
None

In [57]:
col_name = ['id', 'gender', 'age', 'income','spending_rating' ]
df = df.set_axis(col_name, axis = 'columns')
df.to_csv('processed_1.csv', index=False, header=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               199 non-null    float64
 1   gender           199 non-null    object
 2   age              197 non-null    float64
 3   income           197 non-null    float64
 4   spending_rating  199 non-null    float64
dtypes: float64(4), object(1)
memory usage: 7.9+ KB

In [58]:
print(df[df.id.isnull()])

    id gender  age  income  spending_rating
19 NaN    NaN  NaN     NaN              NaN

In [59]:
df.dropna(subset = ['id'], inplace=True)

In [60]:
print(df[df['age'].isnull() == True])

      id  gender  age  income  spending_rating
7    8.0  Female  NaN    18.0             94.0
14  15.0    Male  NaN    20.0             13.0

In [61]:
avg_ages_by_g = [round(df[(df.gender == x) & (df.age.isna() == False)].age.mean()) for x in df.gender.unique()]
avg_ages_by_g

[39, 39]

In [62]:
df.gender.unique()

array(['Male', 'Female'], dtype=object)

In [63]:
df.loc[df.id.isin([8.0, 15.0])]

      id  gender  age  income  spending_rating
7    8.0  Female  NaN    18.0             94.0
14  15.0    Male  NaN    20.0             13.0

In [64]:
df.loc[(df.gender == 'Male') & (df.age.isna()), 'age'] = avg_ages_by_g[0]
df.loc[(df.gender == 'Female') & (df.age.isna()), 'age'] = avg_ages_by_g[1]

In [65]:
df.loc[df.id.isin([8.0, 15.0])]

      id  gender   age  income  spending_rating
7    8.0  Female  39.0    18.0             94.0
14  15.0    Male  39.0    20.0             13.0

In [66]:
print(df[df.duplicated() == True])
print(df.duplicated().sum())

        id  gender   age  income  spending_rating
195  195.0  Female  47.0   120.0             16.0
1

In [67]:
df = df.drop_duplicates().reset_index(drop=True)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198 entries, 0 to 197
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               198 non-null    float64
 1   gender           198 non-null    object
 2   age              198 non-null    float64
 3   income           196 non-null    float64
 4   spending_rating  198 non-null    float64
dtypes: float64(4), object(1)
memory usage: 7.9+ KB

In [69]:
avg_income_by_g = [round(df[(df.gender == x) & (df.income.isna() == False)].income.mean()) for x in df.gender.unique()]
df.loc[(df.gender == 'Male') & (df.income.isna()), 'income'] = avg_income_by_g[0]
df.loc[(df.gender == 'Female') & (df.income.isna()), 'income'] = avg_income_by_g[1]

In [70]:
df.to_csv("proced1.csv", index=False, header=True)
df = pd.read_csv("proced1.csv", encoding='cp1251')
print(df.duplicated().sum())
df.info()

0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198 entries, 0 to 197
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               198 non-null    float64
 1   gender           198 non-null    object
 2   age              198 non-null    float64
 3   income           198 non-null    float64
 4   spending_rating  198 non-null    float64
dtypes: float64(4), object(1)
memory usage: 7.9+ KB

### Задание

* 1.Найти датасет содержавший поля с разными типами данных; 
* 2.Загрузить датасет в Pandas DataFrame и посмотреть сводную информацию о датасете;

In [71]:
study_perf_ds = pd.read_csv("study_performance.csv", sep=",")

study_perf_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

* 3. Переименовать одну или все колонки;

In [72]:
st_perf_columns = [x.replace(" ", "_") for x in study_perf_ds.columns]
print(st_perf_columns)

study_perf_ds = study_perf_ds.set_axis(st_perf_columns, axis = 'columns')

['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch', 'test_preparation_course', 'math_score', 'reading_score', 'writing_score']

In [73]:
study_perf_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [75]:
study_perf_ds.math_score.describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math_score, dtype: float64

* 4. Определить пустые строки и удалить;

In [76]:
study_perf_ds.dropna(how='all')

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

 * 5. Определить пустые ячейки, вывести на экран и заменить средним значением колонки, средним значением с учетом параметра другой колонки.

In [77]:
print(study_perf_ds.isna().sum())
# нет пропусков

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [81]:
avg_st_perf_values = {}
for col in st_perf_columns[5:7]:
    avg_st_perf_values[col] = study_perf_ds[f"{col}"].mean()

# посчитае средний мас скор по гендерам
avg_math_by_g = [round(study_perf_ds[(study_perf_ds.gender == x) & (study_perf_ds.math_score.isna() == False)].math_score.mean()) for x in study_perf_ds.gender.unique()]
print(avg_math_by_g)
study_perf_ds.loc[(study_perf_ds.gender == 'Male') & (study_perf_ds.math_score.isna()), 'math_score'] = avg_math_by_g[0]
study_perf_ds.loc[(study_perf_ds.gender == 'Female') & (study_perf_ds.math_score.isna()), 'math_score'] = avg_math_by_g[1]

[64, 69]

In [82]:
for k in avg_st_perf_values:

    study_perf_ds.loc[(study_perf_ds[f"{k}"].isna() == True), f'{k}'] = avg_st_perf_values[k]

* 6. Найти дубликаты, вывести на экран и удалить;

In [83]:
print(study_perf_ds[study_perf_ds.duplicated() == True])
print(study_perf_ds.duplicated().sum())

df_wines = study_perf_ds.drop_duplicates().reset_index(drop=True)

Empty DataFrame
Columns: [gender, race_ethnicity, parental_level_of_education, lunch, test_preparation_course, math_score, reading_score, writing_score]
Index: []
0

In [84]:
study_perf_ds.to_csv("prep_st_perf_vals.csv", index=False, header=True)